In [1]:
# projet analyse de donné < realise par yahia TEFFAHI __ MASTER 1 __ IA ___G2 >

import pandas as pd

df = pd.read_csv("StudentsPerformance.csv")

df.head() # first 5 lines

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [14]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [15]:
df.sample(3) #3 random line

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
793,male,group E,some high school,standard,completed,89,84,77
364,male,group C,some college,standard,none,59,60,58
461,male,group B,some college,free/reduced,none,54,54,45

In [12]:
df.shape   # dimontion (rows , colms)

(1000, 8)

In [14]:
df.columns
print(df.columns)

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [15]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [17]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [21]:
df["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [22]:
df["gender"].nunique()

2

In [29]:
pd.set_option("display.max_columns",None) 
print(df)

     gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 8 columns]

In [30]:
pd.set_option("display.precision",2) 
print(df)

     gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 8 columns]

In [31]:
df ["gender"]

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [33]:
df [["gender","race/ethnicity"]]

     gender race/ethnicity
0    female        group B
1    female        group C
2    female        group B
3      male        group A
4      male        group C
..      ...            ...
995  female        group E
996    male        group C
997  female        group C
998  female        group D
999  female        group D

[1000 rows x 2 columns]

In [32]:
df.iloc[0]

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [34]:
df.iloc[0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [38]:
df.loc[df["math score"]>50]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [53]:
df["noth_total"] = df["math score"] + df["writing score"] + df["reading score"]
pd.reset_option("display.max_columns")
print(df)
print(df.columns)

     gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score  \
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

     noth_total
0           218
1           247
2           278
3           148
4           229
..          ...
995         282
996         172
997         195
998         223
999         249

[1000 rows x 9 columns]
Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score', 'noth_total'],
      dtype='object')

In [54]:
df.drop ("noth_total" , axis = 1 , inplace = True) 
print(df)

     gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 8 columns]

In [48]:
df[df["math score"]==df["math score"].min()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0,17,10

In [49]:
df.sort_values(by ="math score",ascending =False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33
787,female,group B,some college,standard,none,19,38,32
17,female,group B,some high school,free/reduced,none,18,32,28
980,female,group B,high school,free/reduced,none,8,24,23
59,female,group C,some high school,free/reduced,none,0,17,10

In [42]:

# work shop 02_____________________________________________________________________________________________________________________________________

df.rename(columns={"race/ethnicity" :"groupe"},inplace =True)
df.head()

,gender,groupe,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [6]:
#Compter les valeurs manquantes dans un DataFrame 
nb=df.isnull().sum()
print(nb)

gender                         0
groupe                         0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [41]:
#Afficher uniquement les lignes contenant au moins une valeur manquante 
df [df.isnull().any(axis = 1)]

Empty DataFrame
Columns: [gender, groupe, parental level of education, lunch, test preparation course, math score, reading score, writing score]
Index: []

In [43]:
df.loc[len(df)] = {
   "gender" : "female",
   "groupe" : "group C",
   "parental level of education" : "some college",
   "lunch" : "standard",
   "test preparation course" : "completed",
   "math score" : 50,
   "reading score" : 60,
   "writing score" : 75
}

df.tail()

,gender,groupe,parental level of education,lunch,test preparation course,math score,reading score,writing score
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group C,some college,standard,completed,50,60,75

In [54]:
new_rew = pd.DataFrame([ {
   "gender" : "female",
   "race/ethnicity" : "group B",
   "parental level of education" : "some college",
   "lunch" : "standard",
   "test preparation course" : "completed",
   "math score" : 50,
   "reading score" : 60,
   "writing score" : 75
}])
df =pd.concat([df,new_rew],ignore_index =True )
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,groupe
996,male,group C,high school,free/reduced,none,62,55,55,NaN
997,female,group C,high school,free/reduced,completed,59,71,65,NaN
998,female,group D,some college,standard,completed,68,78,77,NaN
999,female,group D,some college,free/reduced,none,77,86,86,NaN
1000,female,group B,some college,standard,completed,50,60,75,NaN

In [16]:
#Ajoute 3 lignes vides à la fin d'un DataFrame : 
import pandas as pd
import numpy as np
empty_rew = pd.DataFrame([ {
     "gender" : np.nan,
   "race/ethnicity" : np.nan,
   "parental level of education" : np.nan,
   "lunch" : np.nan,
   "test preparation course" : np.nan,
   "math score" : np.nan,
   "reading score" : np.nan,
   "writing score" : np.nan
} for _ in range(3)])
df =pd.concat([df,empty_rew],ignore_index =True )
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
nb =df.isnull().sum()
print(nb)
df[df.isnull().any(axis =1)]

gender                         3
race/ethnicity                 3
parental level of education    3
lunch                          3
test preparation course        3
math score                     3
reading score                  3
writing score                  3
dtype: int64

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1002,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
#Remplacer les valeurs manquantes dans la colonne 'math score' par la valeur moyenne de cette colonne
df["math score"]=df["math score"].fillna(df["math score"].mean())
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
998,female,group D,some college,standard,completed,68.000,78.0,77.0
999,female,group D,some college,free/reduced,none,77.000,86.0,86.0
1000,NaN,NaN,NaN,NaN,NaN,66.089,NaN,NaN
1001,NaN,NaN,NaN,NaN,NaN,66.089,NaN,NaN
1002,NaN,NaN,NaN,NaN,NaN,66.089,NaN,NaN

In [18]:
#Remplacer les valeurs manquantes dans la colonne 'gender' par le texte 'Unknown'
df["gender"]=df["gender"].fillna("Unknown")
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1003,Unknown,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1004,Unknown,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1005,Unknown,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
#Remplacer les valeurs manquantes (NaN) par la dernière valeur non manquante précédente 
df =df.ffill()
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
998,female,group D,some college,standard,completed,68.000,78.0,77.0
999,female,group D,some college,free/reduced,none,77.000,86.0,86.0
1000,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0

In [12]:
#Remplace les valeurs manquantes (NaN) par la prochaine valeur non manquante suivante
df =df.bfill()
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
998,female,group D,some college,standard,completed,68.000,78.0,77.0
999,female,group D,some college,free/reduced,none,77.000,86.0,86.0
1000,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0

In [14]:
#Calculer la médiane de la colonne et remplacer les NaN en une seule étape 
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy ="median")
df[["reading score"]] = imputer.fit_transform(df[["reading score"]])
df.tail(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
998,female,group D,some college,standard,completed,68.000,78.0,77.0
999,female,group D,some college,free/reduced,none,77.000,86.0,86.0
1000,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0

In [17]:
# Afficher uniquement les lignes où la colonne 'model' contient des valeurs manquantes
df[df['lunch'].isnull()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [24]:
#Remplace les valeurs manquantes dans la colonne 'reading score' par 50, mais seulement pour les etudient de la gender female	
df.loc[(df["reading score"].isnull())&(df["gender"]=="female"),'reading score']=50
df.tail(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1003,Unknown,NaN,NaN,Standard,NaN,NaN,NaN,69.0
1004,Unknown,NaN,NaN,Standard,NaN,NaN,NaN,69.0
1005,Unknown,NaN,NaN,Standard,NaN,NaN,NaN,69.0

In [23]:
#Remplacer toutes les valeurs manquantes dans la colonne 'lunch' par la valeur 'Standard' 
#Remplacer les valeurs manquantes dans la colonne 'writing score' par la valeur médiane de cette colonne 
df.loc[df["lunch"].isnull(),'lunch']="Standard"
df.loc[df["writing score"].isnull(),'writing score']=df["writing score"].median()
df.tail(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1001,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1002,Unknown,group D,some college,free/reduced,none,66.089,86.0,86.0
1003,Unknown,NaN,NaN,Standard,NaN,NaN,NaN,69.0
1004,Unknown,NaN,NaN,Standard,NaN,NaN,NaN,69.0
1005,Unknown,NaN,NaN,Standard,NaN,NaN,NaN,69.0

In [30]:
#Calculer l'intervalle interquartile (IQR) pour la colonne 'reading score', 
#Identifier les valeurs aberrantes (outliers) dans la colonne 'reading score' 
Q1=df ['reading score'].quantile(0.25)
Q3=df ['reading score'].quantile(0.75)
IQR = Q3 - Q1
outliers =df [(df ['reading score']<Q1-1.5*IQR) | (df ['reading score']>Q3+1.5*IQR)]
outliers

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0.0,17.0,10.0
76,male,group E,some high school,standard,none,30.0,26.0,22.0
327,male,group A,some college,free/reduced,none,28.0,23.0,19.0
596,male,group B,high school,free/reduced,none,30.0,24.0,15.0
980,female,group B,high school,free/reduced,none,8.0,24.0,23.0

In [37]:
#Utiliser le Z-score pour détecter les valeurs aberrantes dans la colonne 'math score'
from scipy.stats import zscore
df['zscore'] =zscore(df['math score'])
df[df['zscore'].abs()>3]

Empty DataFrame
Columns: [gender, race/ethnicity, parental level of education, lunch, test preparation course, math score, reading score, writing score, zscore]
Index: []

In [38]:
#Compter le nombre de lignes dupliquées 
df.duplicated().sum()

np.int64(4)

In [39]:
#Supprime les lignes dupliquées du DataFrame
df.drop_duplicates(inplace=True)

In [41]:
#Convertir le type de données de la colonne 'reading score' en nombres décimaux 
df['reading score']=df['reading score'].astype(float)

In [3]:
df.groupby('reading score').mean(numeric_only=True) 
# This tells Pandas to group by the 'reading score' column and t
# hen calculate the mean for all other numeric columns.

               math score  writing score
reading score
17               0.000000      10.000000
23              28.000000      19.000000
24              19.000000      19.000000
26              30.000000      22.000000
28              35.000000      27.000000
...                   ...            ...
95              86.875000      92.500000
96              94.500000      92.000000
97              87.400000      96.200000
99              90.000000      98.333333
100             94.529412      98.705882

[72 rows x 2 columns]

In [6]:
df.groupby ('gender') ['reading score'].sum()

gender
female    37611
male      31558
Name: reading score, dtype: int64

In [7]:
df.groupby ('race/ethnicity').size()

race/ethnicity
group A     89
group B    190
group C    319
group D    262
group E    140
dtype: int64

In [8]:
df.groupby('race/ethnicity').count()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
race/ethnicity,,,,,,,
group A,89,89,89,89,89,89,89
group B,190,190,190,190,190,190,190
group C,319,319,319,319,319,319,319
group D,262,262,262,262,262,262,262
group E,140,140,140,140,140,140,140

In [9]:
print(df.columns.tolist())

['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course', 'math score', 'reading score', 'writing score']

In [10]:
df.groupby('gender').agg({
    'math score': ['mean', 'max', 'std'],
    'reading score': 'median'   # no spaces in the column name
})

       math score                 reading score
             mean  max        std        median
gender
female  63.633205  100  15.491453          73.0
male    68.728216  100  14.356277          66.0

In [11]:
# This will return the average reading score per combination of race/ethnicity and math score.
gb = df.groupby(['race/ethnicity', 'math score'])
gb['reading score'].mean()

race/ethnicity  math score
group A         28            23.000000
                34            48.000000
                37            57.000000
                38            43.000000
                39            39.000000
                                ...
group E         94            86.250000
                95            89.000000
                97            84.500000
                99            93.333333
                100           98.400000
Name: reading score, Length: 289, dtype: float64

In [13]:
pd.pivot_table(
    df,
    values='reading score',
    index='race/ethnicity',
    columns='lunch',
    aggfunc='mean'
)

lunch           free/reduced   standard
race/ethnicity
group A            60.555556  67.471698
group B            63.971014  69.280992
group C            63.412281  72.268293
group D            66.431579  72.077844
group E            68.731707  74.808081

In [14]:
# To round the results:

pivot = pd.pivot_table(df, 
                       values='reading score', 
                       index='race/ethnicity', 
                       columns='parental level of education', 
                       aggfunc='mean')
pivot.round(0)

parental level of education,associate's degree,bachelor's degree,high school,master's degree,some college,some high school
race/ethnicity,,,,,,
group A,67.0,68.0,63.0,65.0,66.0,62.0
group B,70.0,73.0,63.0,80.0,66.0,66.0
group C,71.0,76.0,64.0,71.0,69.0,66.0
group D,71.0,70.0,64.0,77.0,71.0,70.0
group E,74.0,75.0,70.0,82.0,73.0,70.0

In [16]:
df.groupby('race/ethnicity')['reading score'].mean().sort_values(ascending = False)

race/ethnicity
group E    73.028571
group D    70.030534
group C    69.103448
group B    67.352632
group A    64.674157
Name: reading score, dtype: float64

In [17]:
# Re-import libraries after code execution reset
import pandas as pd

# Reload the original cars.csv dataset
df_StudentsPerformance = pd.read_csv('StudentsPerformance.csv')

# Simulated second DataFrame for merging demonstration
df_extra = pd.DataFrame({
    'race/ethnicity': ['group E', 'group D', 'group C', 'group A'],
    'avg_group': [50, 70, 80, 120]
})

# Perform the merge
merged_df = pd.merge(df_StudentsPerformance, df_extra, on='race/ethnicity', how='inner')

merged_df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_group
0,female,group C,some college,standard,completed,69,90,88,80
1,male,group A,associate's degree,free/reduced,none,47,57,44,120
2,male,group C,some college,standard,none,76,78,75,80
3,male,group D,high school,free/reduced,completed,64,64,67,70
4,male,group C,associate's degree,standard,none,58,54,52,80

In [20]:

pd . concat ( [ df1 , df2 ], axis = 0 ) 		# line by line
pd . concat ( [ df1 , df2 ], axis = 1 ) 		# column by column

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,female,group C,some college,standard,completed,69.0,90.0,88.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,female,group B,associate's degree,standard,none,71.0,83.0,78.0
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,female,group B,some college,standard,completed,88.0,95.0,92.0
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,male,group B,some college,free/reduced,none,40.0,43.0,39.0
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,male,group D,high school,free/reduced,completed,64.0,64.0,67.0
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,female,group B,high school,free/reduced,none,38.0,60.0,50.0

In [19]:
import pandas as pd

# Load your StudentsPerformance.csv file
df_StudentsPerformance = pd.read_csv('StudentsPerformance.csv')

# Split and concatenate
df1 = df_StudentsPerformance.iloc[:5]
df2 = df_StudentsPerformance.iloc[5:10]

# Row-wise concat (stack rows)
concat_rows = pd.concat([df1, df2], axis=0)
print("Row-wise concatenation:")
print(concat_rows.head(10))

# Column-wise concat (side by side)
concat_cols = pd.concat([df1.reset_index(drop=True), df2.reset_index(drop=True)], axis=1)
print("\nColumn-wise concatenation:")
print(concat_cols.head())

Row-wise concatenation:
   gender race/ethnicity parental level of education         lunch  \
0  female        group B           bachelor's degree      standard
1  female        group C                some college      standard
2  female        group B             master's degree      standard
3    male        group A          associate's degree  free/reduced
4    male        group C                some college      standard
5  female        group B          associate's degree      standard
6  female        group B                some college      standard
7    male        group B                some college  free/reduced
8    male        group D                 high school  free/reduced
9  female        group B                 high school  free/reduced

  test preparation course  math score  reading score  writing score
0                    none          72             72             74
1               completed          69             90             88
2                    none          90             95             93
3                    none          47             57             44
4                    none          76             78             75
5                    none          71             83             78
6               completed          88             95             92
7                    none          40             43             39
8               completed          64             64             67
9                    none          38             60             50

Column-wise concatenation:
   gender race/ethnicity parental level of education         lunch  \
0  female        group B           bachelor's degree      standard
1  female        group C                some college      standard
2  female        group B             master's degree      standard
3    male        group A          associate's degree  free/reduced
4    male        group C                some college      standard

  test preparation course  math score  reading score  writing score  gender  \
0                    none          72             72             74  female
1               completed          69             90             88  female
2                    none          90             95             93    male
3                    none          47             57             44    male
4                    none          76             78             75  female

  race/ethnicity parental level of education         lunch  \
0        group B          associate's degree      standard
1        group B                some college      standard
2        group B                some college  free/reduced
3        group D                 high school  free/reduced
4        group B                 high school  free/reduced

  test preparation course  math score  reading score  writing score
0                    none          71             83             78
1               completed          88             95             92
2                    none          40             43             39
3               completed          64             64             67
4                    none          38             60             50